Repository: jcurl/RJCP.DLL.Environment
Catalog: Environment/Resources/Messages.*.resx
Languages: de

# ArgumentEx_NotOsVersion
source: Not an OSVersion
de: Das Object ist nicht vom Typ OSVersion

# ArgumentEx_XdgUnknownSpecialFolder
source: Unknown special folder
de: Unbekannter Ordnertyp

# InvalidOperationEx_CheckLock
source: Cannot set '{0}' on Sealed instance
de: Kann nicht '{0}' auf Sealed Instanz setzen

# InvalidOperationEx_InternalGetOsVersion
source: Internal Error: Must get OS version information first
de: Intern Fehler: Zuerst müssen Informationen zur OS Version abgerufen werden

# InvalidOperationEx_XdgUnknownHome
source: Unable to determine home directory path
de: Pfad des Home-Verzeichnisses kann nicht ermittelt werden

# Net45_Unknown
source: Unknown .NET version before .NET 4.5 ({0})
de: Unbekannte .NET Version vor .NET 4.5 ({0})

# Net451_Vista
source: .NET Framework 4.5.1 installed on Windows 8, Windows 7 SP1, or Windows Vista SP2
de: .NET Framework 4.5.1 auf Windows 8, Windows 7 SP1, oder Windows Vista SP2 installiert

# Net451_Win81
source: .NET Framework 4.5.1 installed with Windows 8.1 or Windows Server 2012 R2
de: .NET Framework 4.5.1 auf Windows 8.1 or Windows Server 2012 R2 installiert

# Net46_Win10
source: .NET Framework 4.6 on Windows 10 (1507)
de: .NET Framework 4.6 auf Windows 10 (1507)

# Net461_Win10
source: .NET Framework 4.6.1 on Windows 10, November Update (1511)
de: .NET Framework 4.6.1 auf Windows 10, November Update (1511)

# Net462_Win10
source: .NET Framework 4.6.2 on Windows 10, Anniversary Update (1607) or Windows Server 2016
de: .NET Framework 4.6.2 auf Windows 10, Anniversary Update (1607) oder Windows Server 2016

# Net47_Win10
source: .NET Framework 4.7 on Windows 10, Creators Update (1703)
de: .NET Framework 4.7 auf Windows 10, Creators Update (1703)

# Net471_Win10
source: .NET Framework 4.7.1 on Windows 10, Fall Creators Update (1709)
de: .NET Framework 4.7.1 auf Windows 10, Fall Creators Update (1709)

# Net472_Win10
source: .NET Framework 4.7.2 on Windows 10, Spring Creators Update (1803)
de: .NET Framework 4.7.2 auf Windows 10, Spring Creators Update (1803)

# Net48_Win10_1903
source: .NET Framework 4.8 on Windows 10, May 2019 Update (1903)
de: .NET Framework 4.8 auf Windows 10, May 2019 Update (1903)

# Net48_Win10_1909
source: .NET Framework 4.8 on Windows 10, October 2019 Update (1909)
de: .NET Framework 4.8 auf Windows 10, October 2019 Update (1909)

# Net48_Win10_20H2
source: .NET Framework 4.8 on Windows 10, October 2020 Update (20H2, 21H1)
de: .NET Framework 4.8 auf Windows 10, October 2020 Update (20H2, 21H1)

# Net48_Win11
source: .NET Framework 4.8 on Windows 11 / Server 2022
de: .NET Framework 4.8 auf Windows 11 / Server 2022

# NetFx
source: .NET {0} or later, release {1}
de: .NET {0} or später, Release {1}

# NetFx45Details
source: .NET Framework v{0}, Release {1} ({2})
de: .NET Framework Net Version {0}, Release {1}

# NetFxLegacyProfile
source: Profile
de: Profil

# NetFxRuntime
source: .NET Environment Runtime
de: .NET Umgebungsruntime

# PlatformNotSupportedEx
source: WinVersionQuery is only supported on Windows
de: WinVersionQuery ist nur auf Windows unterstutzt

# Win32Ex_GetVersionEx
source: GetVersionEx() failure. Error = 0x{0:8x}
de: GetVersionEx() fehler, mit Code = 0x{0:8x}

# Net481_Win11_22H2
source: .NET Framework 4.8.1 on Windows 11 22H2
de: .NET Framework auf Windows 11 22H2
